branches/FFF/Documentation/Source/Time_Card.tex
\documentclass[tablesignature]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fancyhdr}
\usepackage{subfig}
\usepackage{listings}
\lstnewenvironment{common-lispcode}
{\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
{}
\usepackage{paralist}
\let\itemize\compactitem
\let\description\compactdesc
\let\enumerate\compactenum
\usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
\pagestyle{fancy}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Time Card Usage in Zambia}
\author{Percy}
\date{March 2012}

\begin{document}

\maketitle

% Org-mode is exporting headings to 3 levels.

\pagenumbering{roman}
\thispagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{1pt}
\lhead{}
\rhead{}
\chead{}
\lfoot{{Percy} <{nela.program@gmail.com}>}
\cfoot{}
\rfoot{\thepage}
\begin{abstract}
\vspace{5cm}
{\LARGE{\textbf{Abstract:\\}}}
Zambia is a piece of Conference Management Software.  This document is a ``How To'' guide assisting in the way of keeping track of Volunteer Hours for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
\end{abstract}
\newpage
\renewcommand{\headrulewidth}{1pt}
\chead{{Time Card Usage in Zambia}}
\tableofcontents
\listoftables
\listoffigures
\newpage
\pagenumbering{arabic}
\section{Introduction}
\label{sec-1}


  Checking in and checking out people (including yourself) is an
  importnat part of how the conference runs.  It is important before,
  during, and after the conference, for tracking hours, to see who is
  overburdened and needs more help, who is underutilized, and, if the
  volunteers are rewarded, who gets what and how to keep track of each
  of them.  It also allows you to figure out your coverage issues,
  when you need more people, and when you need less.
\section{Self Check-In/Check-Out}
\label{sec-2}


  The Check-In/Check-Out system is fairly striaght-forward.  
\subsection{To Check In}
\label{sec-2_1}


   In the staff view (green tabs) you just have to select the
   ``TimeCards'' tab.  The default view you get at this point should
   have you listed as the ``Volunteer:'' to check in.  Simply click on
   the ``Choose'' button.  This will take you to the Check In page.

   If you are about to start working, as in, checking in now, simply
   click the button reading ``Check in <YOUR NAME> now.''  You are now
   checked in.  After you are done with your FFF work, follow the
   check-out procedure.

   If, instead, you started working a bit ago, and forgot to check
   yourself in, or you worked some time, not near a computer, and need
   to retroactively create your check-in/check-out records, simply
   enter the start time of the period you worked in the box labeled
   ``Actual Start time for <YOUR NAME>:'' The format for that is
   YYYY-MM-DD hh:mm:ss (A four digit year, a dash, followed by a two
   digit month, a dash, followed by a two digit day, a space, followed
   by a two digit hour, a colon, followed by a two-digit minute, a
   colon, followed by a two digit second (Yes, you need the leading
   zeros, if any of the values are less than 10.) to be correct.)
   NOTE: This is a 24 hour clock.  Noon is 12, Midnight is 00, 1pm is
   13, and so forth.  There is a defualut time (now) in there, so if
   it was ten minutes ago, it's really easy to adjust for.  Keeping
   time to the second is not necessary.  Depending on your conference,
   you might be rounding to the nearest larger chunk of time (15
   minute, half an hour, whatever is decided) anyway, so follow the
   conventions of your conference.
\subsection{To Check Out}
\label{sec-2_2}


   In the staff view (green tabs) you just have to select the
   ``TimeCards'' tab.  From here, select the ``Check Out'' link just above
   the box containing your name.  This will take you to the Check Out
   page.  The default view you get at this point should have you and
   the time you checked in listed as the ``Volunteer:'' to check out.
   Simply click on the ``Choose'' button.  If, somehow, you have more
   than one check-in instance, please work through each of them, to
   make sure your hours are accounted for.

   If you have just finished working, as in, checking out now, simply
   click the button reading ``Check out <YOUR NAME> now.''  You are now
   checked out.

   If, instead, you finished working a bit ago, and forgot to check
   yourself out, or you worked some time, not near a computer, and
   need to retroactively create your check-in/check-out records,
   simply enter the end time of the period you worked in the box
   labeled ``Actual end time for shift starting at <YOUR START TIME>
   for <YOUR NAME>:'' The format for that is YYYY-MM-DD hh:mm:ss (A
   four digit year, a dash, followed by a two digit month, a dash,
   followed by a two digit day, a space, followed by a two digit hour,
   a colon, followed by a two-digit minute, a colon, followed by a two
   digit second (Yes, you need the leading zeros, if any of the values
   are less than 10.) to be correct.)  NOTE: This is a 24 hour clock.
   Noon is 12, Midnight is 00, 1pm is 13, and so forth.  There is a
   defualut time (now) in there, so if it was ten minutes ago, it's
   really easy to adjust for.  Keeping time to the second is not
   necessary.  Depending on your conference, you might be rounding to
   the nearest larger chunk of time (15 minute, half an hour, whatever
   is decided) anyway, so follow the conventions of your conference.
\section{Other Volunteer Check-In/Check-Out}
\label{sec-3}
\subsection{Not scheduled people during, or anyone before or after the conference}
\label{sec-3_1}
\subsection{Expected people on their shifts during the conference}
\label{sec-3_2}
\section{Useful Reports/Pages}
\label{sec-4}
\subsection{VolunteerCheckIn.php}
\label{sec-4_1}

\label{VolunteerCheckIn.php}

   This page is the check in page, it is accessable under the TimeCard
   tab on any of the staff (green tab) pages.
\subsection{VolunteerCheckOut.php}
\label{sec-4_2}

\label{VolunteerCheckOut.php}

   This page is the check out page, it is accessable from most of the
   staff check in pages.
\subsection{genreport.php?reportname=myusefultimecardtabledump}
\label{sec-4_3}

\label{genreport.php?reportname=myusefultimecardtabledump}

   This report is to check on your own hours.  It is to make sure you
   didn't forget to record any, or to see if you left yourself checked
   in at any time previous.

\end{document}
